Synwit-Co-Ltd/Synwit.SWM32_DFP/SVD/SWM231.svd
        <register>
          <name>IPARKRAD</name>
          <description>IPARKRAD register</description>
          <addressOffset>0x000094</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SIN</name>
              <description>SIN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COS</name>
              <description>COS field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPARKOAB</name>
          <description>IPARKOAB register</description>
          <addressOffset>0x00009C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>OA</name>
              <description>OA field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OB</name>
              <description>OB field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMIAB</name>
          <description>PWMIAB register</description>
          <addressOffset>0x0000A8</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>IA</name>
              <description>IA field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IB</name>
              <description>IB field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMMIN</name>
          <description>PWMMIN register</description>
          <addressOffset>0x0000B0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>MIN</name>
              <description>MIN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMP3</name>
              <description>SAMP3 field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMDLY</name>
          <description>PWMDLY register</description>
          <addressOffset>0x0000B4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAMP1</name>
              <description>SAMP1 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMP2</name>
              <description>SAMP2 field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMTIM</name>
          <description>PWMTIM register</description>
          <addressOffset>0x0000BC</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PERIOD</name>
              <description>PERIOD field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DZ</name>
              <description>DZ field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMTSP</name>
          <description>PWMTSP register</description>
          <addressOffset>0x0000C4</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>POINT1</name>
              <description>POINT1 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POINT2</name>
              <description>POINT2 field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMTAD</name>
          <description>PWMTAD register</description>
          <addressOffset>0x0000C8</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>PWMTBD</name>
          <description>PWMTBD register</description>
          <addressOffset>0x0000CC</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>PWMTCD</name>
          <description>PWMTCD register</description>
          <addressOffset>0x0000D0</addressOffset>
          <access>read-only</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>Registers group</description>
      <groupName>DMA</groupName>
      <baseAddress>0x40000800</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000030</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>GLB0</name>
              <description>GLB0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE0</name>
              <description>DONE0 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALF0</name>
              <description>HALF0 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR0</name>
              <description>ERR0 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFC</name>
          <description>IFC register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>GLB0</name>
              <description>GLB0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DONE0</name>
              <description>DONE0 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALF0</name>
              <description>HALF0 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR0</name>
              <description>ERR0 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <name>CH0</name>
          <description>register cluster</description>
          <addressOffset>0x000010</addressOffset>
          <register>
            <name>MUX</name>
            <description>MUX register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>MRDHSSIG</name>
                <description>MRDHSSIG field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MRDHSEN</name>
                <description>MRDHSEN field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MWRHSSIG</name>
                <description>MWRHSSIG field</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MWRHSEN</name>
                <description>MWRHSEN field</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EXTHSSIG</name>
                <description>EXTHSSIG field</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EXTHSEN</name>
                <description>EXTHSEN field</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CR</name>
            <description>CR register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>EN</name>
                <description>EN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DONEIE</name>
                <description>DONEIE field</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HALFIE</name>
                <description>HALFIE field</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>ERRIE</name>
                <description>ERRIE field</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DIR</name>
                <description>DIR field</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CIRC</name>
                <description>CIRC field</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PINC</name>
                <description>PINC field</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MINC</name>
                <description>MINC field</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PSIZ</name>
                <description>PSIZ field</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MSIZ</name>
                <description>MSIZ field</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PL</name>
                <description>PL field</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MEM2MEM</name>
                <description>MEM2MEM field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>NDT</name>
            <description>NDT register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>LEN</name>
                <description>LEN field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HALF</name>
                <description>HALF field</description>
                <bitOffset>24</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PAR</name>
            <description>PAR register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>MAR</name>
            <description>MAR register</description>
            <addressOffset>0x000010</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
